In [74]:
import pandas as pd

customer_flight = pd.read_excel("Customer Flight Activity.xlsx")
customer_loyalty = pd.read_excel("Customer Loyalty History.xlsx")
calendar = pd.read_excel("Calendar.xlsx")

In [25]:
customer_flight.head()

,Loyalty Number,Year,Month,Total Flights,Distance,Points Accumulated,Points Redeemed,Dollar Cost Points Redeemed
0,100590,2018,6,12,15276,22914.0,0,0
1,100590,2018,7,12,9168,13752.0,0,0
2,100590,2018,5,4,6504,9756.0,0,0
3,100590,2018,10,0,0,0.0,512,92
4,100590,2018,2,0,0,0.0,0,0

In [23]:
customer_flight.info()
customer_flight.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 392936 entries, 0 to 392935
Data columns (total 8 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   Loyalty Number               392936 non-null  int64
 1   Year                         392936 non-null  int64
 2   Month                        392936 non-null  int64
 3   Total Flights                392936 non-null  int64
 4   Distance                     392936 non-null  int64
 5   Points Accumulated           392936 non-null  float64
 6   Points Redeemed              392936 non-null  int64
 7   Dollar Cost Points Redeemed  392936 non-null  int64
dtypes: float64(1), int64(7)
memory usage: 24.0 MB

Loyalty Number                 0
Year                           0
Month                          0
Total Flights                  0
Distance                       0
Points Accumulated             0
Points Redeemed                0
Dollar Cost Points Redeemed    0
dtype: int64

In [65]:
customer_loyalty.head()

,Loyalty Number,Country,Province,City,Postal Code,Gender,Education,Salary,Marital Status,Loyalty Card,CLV,Enrollment Type,Enrollment Year,Enrollment Month,Cancellation Year,Cancellation Month,Customer Status
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236,Married,Star,3839.14,Standard,2016,2,NaN,NaN,Active
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,<NA>,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN,Active
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,<NA>,Single,Star,3839.75,Standard,2014,7,2018.0,1.0,Cancelled
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,<NA>,Single,Star,3839.75,Standard,2013,2,NaN,NaN,Active
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495,Married,Star,3842.79,Standard,2014,10,NaN,NaN,Active

In [37]:
customer_loyalty.info()
customer_loyalty.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16737 entries, 0 to 16736
Data columns (total 16 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Loyalty Number      16737 non-null  int64
 1   Country             16737 non-null  object
 2   Province            16737 non-null  object
 3   City                16737 non-null  object
 4   Postal Code         16737 non-null  object
 5   Gender              16737 non-null  object
 6   Education           16737 non-null  object
 7   Salary              12499 non-null  float64
 8   Marital Status      16737 non-null  object
 9   Loyalty Card        16737 non-null  object
 10  CLV                 16737 non-null  float64
 11  Enrollment Type     16737 non-null  object
 12  Enrollment Year     16737 non-null  int64
 13  Enrollment Month    16737 non-null  int64
 14  Cancellation Year   2067 non-null   float64
 15  Cancellation Month  2067 non-null   float64
dtypes: float64(4), int64(3), object(9)
memory usage: 2.0+ MB

Loyalty Number            0
Country                   0
Province                  0
City                      0
Postal Code               0
Gender                    0
Education                 0
Salary                 4238
Marital Status            0
Loyalty Card              0
CLV                       0
Enrollment Type           0
Enrollment Year           0
Enrollment Month          0
Cancellation Year     14670
Cancellation Month    14670
dtype: int64

In [51]:
customer_loyalty["Salary"] = customer_loyalty["Salary"].astype("Int64")
customer_loyalty.dtypes

Loyalty Number          int64
Country                object
Province               object
City                   object
Postal Code            object
Gender                 object
Education              object
Salary                  Int64
Marital Status         object
Loyalty Card           object
CLV                   float64
Enrollment Type        object
Enrollment Year         int64
Enrollment Month        int64
Cancellation Year     float64
Cancellation Month    float64
dtype: object

In [75]:
customer_loyalty["Customer Status"] = customer_loyalty["Cancellation Year"].apply(
    lambda x: "Active" if pd.isna(x) else "Cancelled"
)

In [71]:
calendar.head()

        Date Start of Year Start of Quarter Start of Month
0 2012-01-01    2012-01-01       2012-01-01     2012-01-01
1 2012-01-02    2012-01-01       2012-01-01     2012-01-01
2 2012-01-03    2012-01-01       2012-01-01     2012-01-01
3 2012-01-04    2012-01-01       2012-01-01     2012-01-01
4 2012-01-05    2012-01-01       2012-01-01     2012-01-01

In [75]:
calendar.info()
calendar.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2557 entries, 0 to 2556
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Date              2557 non-null   datetime64[ns]
 1   Start of Year     2557 non-null   datetime64[ns]
 2   Start of Quarter  2557 non-null   datetime64[ns]
 3   Start of Month    2557 non-null   datetime64[ns]
dtypes: datetime64[ns](4)
memory usage: 80.0 KB

Date                0
Start of Year       0
Start of Quarter    0
Start of Month      0
dtype: int64

In [78]:
calendar["Year"] = calendar["Date"].dt.year
calendar["Month"] = calendar["Date"].dt.month
calendar.head()

        Date Start of Year Start of Quarter Start of Month  Year  Month
0 2012-01-01    2012-01-01       2012-01-01     2012-01-01  2012      1
1 2012-01-02    2012-01-01       2012-01-01     2012-01-01  2012      1
2 2012-01-03    2012-01-01       2012-01-01     2012-01-01  2012      1
3 2012-01-04    2012-01-01       2012-01-01     2012-01-01  2012      1
4 2012-01-05    2012-01-01       2012-01-01     2012-01-01  2012      1

In [77]:

customer_loyalty.to_excel("customer_loyalty_clean.xlsx", index=False)

In [106]:
customer_loyalty.columns

Index(['Loyalty Number', 'Country', 'Province', 'City', 'Postal Code',
       'Gender', 'Education', 'Salary', 'Marital Status', 'Loyalty Card',
       'CLV', 'Enrollment Type', 'Enrollment Year', 'Enrollment Month',
       'Cancellation Year', 'Cancellation Month', 'Customer Status'],
      dtype='object')

In [83]:
import sqlite3

In [85]:
conn = sqlite3.connect("airline_loyalty.db")

In [13]:
customer_flight.to_sql("customer_flight", conn, if_exists="replace", index=False)
customer_loyalty.to_sql("customer_loyalty", conn, if_exists="replace", index=False)
calendar.to_sql("calendar", conn, if_exists="replace", index=False)

2557

In [16]:
pd.read_sql("SELECT name FROM sqlite_master WHERE type='table';", conn)

               name
0   customer_flight
1  customer_loyalty
2          calendar

In [56]:
pd.read_sql("""
SELECT "Loyalty Number",
       SUM("Total Flights") AS Total_Flights
FROM customer_flight
GROUP BY "Loyalty Number"
ORDER BY Total_Flights DESC
LIMIT 10;
""", conn)

   Loyalty Number  Total_Flights
0          336882            106
1          813455            104
2          385092            102
3          983416            100
4          732304             98
5          110065             97
6          625320             96
7          464187             96
8          556492             95
9          775768             94

In [72]:
pd.read_sql("""
SELECT "Customer Status",
       COUNT(*) AS Total_Customers
FROM customer_loyalty
GROUP BY "Customer Status";
""", conn)

  Customer Status  Total_Customers
0          Active            14670
1       Cancelled             2067

In [87]:
pd.read_sql("""
SELECT Year,
       SUM("Total Flights") AS Total_Flights
FROM customer_flight
GROUP BY Year
ORDER BY Year;
""", conn)

   Year  Total_Flights
0  2017         223262
1  2018         285546

In [89]:
pd.read_sql("""
SELECT "Loyalty Number",
       SUM(Distance) AS Total_Distance
FROM customer_flight
GROUP BY "Loyalty Number"
ORDER BY Total_Distance DESC
LIMIT 10;
""", conn)

   Loyalty Number  Total_Distance
0          689839          178858
1          893866          168640
2          500248          158747
3          775768          157231
4          133324          155877
5          471015          154784
6          385092          154288
7          201273          150231
8          208961          150188
9          556492          149782